[
  {
    "name": "Lúcio",
    "title": "Freedom Fighting DJ",
    "universe": 4,
    "description": "From the streets of Rio to the clubs on King's Row, Lúcio's beats bring the party to life, and drive the people to action. Now he's on tour in the Nexus, ready to break it down, and to continue fighting for what's right.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/lucio/skins/thumbnails/freedom-fighting-dj.jpg"
  },
  {
    "name": "Valeera",
    "title": "Shadow of the Uncrowned",
    "universe": 0,
    "description": "For a time, the gladiator Valeera Sanguinar served dutifully as one of Varian Wrynn's personal bodyguards. Now, her shadowy skills find her a natural fit within the secretive rogue order, the Uncrowned, in their fight against the Legion.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/valeera/skins/thumbnails/standard/shadow-of-the-uncrowned.jpg"
  },
  {
    "name": "Zul'jin",
    "title": "Warlord of the Amani",
    "universe": 0,
    "description": "Before the elves and their Alliance, the forests of Lordaeron belonged to the trolls of the Amani empire. As their warlord, Zul'jin has united the tribes into an army that stands ready to take back what is theirs and to slay the elves who stole it from them.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/zuljin/skins/thumbnails/warlord-of-the-amani.jpg"
  },
  {
    "name": "Ragnaros",
    "title": "The Firelord",
    "universe": 0,
    "description": "Ragnaros, an elemental as old as the world of Azeroth, has been called to many realms… but rarely one so suited to his destructive nature as the Nexus. As he strives to reduce this new land to ash, Ragnaros hews about with the fiery hammer Sulfuras and takes command of allied and destroyed forts, scourging all who approach him with falling rocks and waves of magma. Though his power is vast, those who summon the Firelord must be prepared to watch the world burn.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/ragnaros/skins/thumbnails/the-firelord.jpg"
  },
  {
    "name": "Varian",
    "title": "High King of the Alliance",
    "universe": 0,
    "description": "The gladiator king of Stormwind City, Varian Wrynn, has lived many lives. His anger shook the orcish hordes; his devotion preserved a nation. By wielding the sword Shalamayne two-handed, split into twin blades, or with a shield, Varian shifts his combat tactics: charging into melee with multiple opponents, enduring punishment or dueling one-on-one. Whether King Wrynn or Lo’Gosh the Ghost Wolf stands on the battlefield, the prowess of the man remains the same.",
    "roles": [1, 0],
    "image": "http://media.blizzard.com/heroes/varian/skins/thumbnails/warrior/high-king-of-the-alliance.jpg"
  },
  {
    "name": "Samuro",
    "title": "The Blademaster",
    "universe": 0,
    "description": "Samuro, the last remaining blademaster to wear the banner of the Burning Blade, is on a warrior's pilgrimage in search of vengeance and redemption for his fallen clan. It will be a long journey, but he has sworn an oath to restore his clan's honor.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/samuro/skins/thumbnails/the-blademaster.jpg"
  },
  {
    "name": "Zarya",
    "title": "Defender of Russia",
    "universe": 4,
    "description": "Aleksandra Zaryanova is one of the world's strongest women and was a promising athlete, but all that changed when the Siberian omnium reawakened. As a soldier in the Russian Defense Force, she now proudly uses her strength to protect the ones she loves.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/zarya/skins/thumbnails/defender-of-russia.jpg"
  },
  {
    "name": "Alarak",
    "title": "Highlord of the Tal'darim",
    "universe": 1,
    "description": "Not all heroes are born of altruism... some, like Alarak, simply desire vengeance. As the new Highlord of the Tal'darim, Alarak leads his people to a destiny free of the corrupt influence of the fallen xel'naga, Amon.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/alarak/skins/thumbnails/highlord-of-the-taldarim.jpg"
  },
  {
    "name": "Auriel",
    "title": "Archange of Hope",
    "universe": 2,
    "description": "It is through the archangel Auriel that the power of hope flows into the fabric of creation. Her eternal light illuminates even the darkest souls. Seeking harmony in all things, she is a mediator, a counselor, and when the need arises, a fearless warrior.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/auriel/skins/thumbnails/archangel-of-hope.jpg"
  },
  {
    "name": "Gul'dan",
    "title": "Darkness Incarnate",
    "universe": 0,
    "description": "Abandoning the ways of shamanism, Gul'dan entered a pact with the demon lord Kil'jaeden and betrayed his people in exchange for limitless power. But it came at a great cost: Gul'dan must sacrifice part of his own life force to fuel his destructive fel magics. With the orcish Horde under his master's thrall, both Draenor and Azeroth nearly fell into his grasp. Now, Gul'dan is set to spread his corruption across the Nexus!",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/guldan/skins/thumbnails/darkness-incarnate.jpg"
  },
  {
    "name": "Medivh",
    "title": "The Last Guardian",
    "universe": 0,
    "description": "Under the influence of the demon lord Sargeras, Medivh opened the Dark Portal and unleashed the orcish Horde upon Azeroth. To atone for this sin, he rallied a new generation of heroes to stand against the Burning Legion during the Third War. In the Nexus, Medivh continues to lead his allies to greatness. He observes the battle from up high in Raven Form, then swoops down and uses shields and portals to turn the tide of battle. Now, he takes his place amongst the legends.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/medivh/skins/thumbnails/the-last-guardian.jpg"
  },
  {
    "name": "Chromie",
    "title": "Keeper of Time",
    "universe": 0,
    "description": "At first glance, Chromie appears to be an ordinary gnome. In truth, she is Chronormu, Bronze Dragon and a master of time. Chromie uses her powers to control the flow of battle, slowing her enemies or even forcefully displacing them through time. When it comes to temporal manipulation, there’s no problem she can’t solve… with some help from her future self, of course.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/chromie/skins/thumbnails/keeper-of-time.jpg"
  },
  {
    "name": "Tracer",
    "title": "Agent of Overwatch",
    "universe": 4,
    "description": "Lena Oxton (call sign: Tracer) is an adventurer and an irrepressible force for good. With the ability to alter her own time at will, she fights the good fight wherever she goes – even the Nexus. Bending space and time, Tracer is an extremely mobile and deadly teammate. Don’t worry, loves. The cavalry’s here.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/tracer/skins/thumbnails/agent-of-overwatch.jpg"
  },
  {
    "name": "Dehaka",
    "title": "Primal Pack Leader",
    "universe": 1,
    "description": "On Zerus, the zerg pack leader Dehaka was a constantly evolving apex predator. His drive to slay the strongest prey and consume their Essence has now led him to the Nexus, where Dehaka stalks his opponents across the battlefield. Able to regenerate through massive damage and swiftly move into and out of combat, Dehaka uses the primal zerg’s mutability to deadly effect.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/dehaka/skins/thumbnails/primal-pack-leader.jpg"
  },
  {
    "name": "Xul",
    "title": "Cryptic Necromancer",
    "universe": 2,
    "description": "From the recesses of the eastern jungles comes a man cloaked in mystery. As a member of the secretive Priests of Rathma, or the Necromancers, Xul fights to preserve the delicate balance between order and chaos. Using powerful death magic, Xul will sap the strength of his enemies, block their escape, and direct his spectral scythe with lethal accuracy. Those who fall before the Necromancer find no peace even in death, rising again as skeletal servants bound to do their master’s bidding.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/xul/skins/thumbnails/cryptic-necromancer.jpg"
  },
  {
    "name": "Li-Ming",
    "title": "Rebellious Wizard",
    "universe": 2,
    "description": "It’s a generally agreed upon fact of life among the denizens of Sanctuary that wizards and magical mayhem are never far apart. Although she understands people’s concerns, Li-Ming is entirely unapologetic for the destruction in her wake. She delights in unleashing devastating spells on her foes from afar, then teleporting away to frustrate her enemies’ attempts at striking back. Small minds may fear this kind of power, but Li-Ming wields the arcane forces of the universe with confidence and unmatched skill.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/li-ming/skins/thumbnails/rebellious-wizard.jpg"
  },
  {
    "name": "Greymane",
    "title": "Lord of the Worgen",
    "universe": 0,
    "description": "Like most Gilneans, Genn Greymane is afflicted by the lycanthropic Worgen curse. Though he feels at fault for his people’s ill fate, he has embraced his inner beast without giving in to its feral nature. On the field of battle, Greymane relies on the marksman’s cunning to set up his targets and the beast’s savagery to pounce with deadly speed and accuracy. Now he leads his pack as both their alpha and their king.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/greymane/skins/thumbnails/greymane/lord-of-the-worgen.jpg"
  },
  {
    "name": "Lunara",
    "title": "First Daughter of Cenarius",
    "universe": 0,
    "description": "The dryads watch over the shadowed forests of Kalimdor. Fleet-footed, clever, and playful, they protect their home with tender loving care. But where her sisters are the delicate flowers of the deep forest, the dryad Lunara, first daughter of the demigod Cenarius, is the thorn that guards them. Lunara nimbly strikes from afar, withering her enemies with toxins, then bounds away before anyone can lay a hand on her. Take care if you face her in the Nexus, or Lunara will make an endangered species out of you!",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/lunara/skins/thumbnails/first-daughter-of-cenarius.jpg"
  },
  {
    "name": "Cho'gall",
    "title": "Twilight's Hammer Chieftain",
    "universe": 0,
    "description": "Two personalities share the body of Cho’gall: Gall, cunning master of dark magics and forbidden incantations, and Cho, who’s never met a problem he couldn’t punch really, really hard. When working together, Cho’s powerful attacks and Gall’s destructive spells feed into each other to make Cho’gall’s enemies rue the day they crossed paths with this ogre. With Cho’s brawn and Gall’s dark powers, these two are ready to take the Nexus by storm… as soon as they can agree on a plan.",
    "roles": [1, 0],
    "image": "http://media.blizzard.com/heroes/chogall/skins/thumbnails/cho/twilights-hammer-chieftain.jpg"
  },
  {
    "name": "Artanis",
    "title": "Hierarch of the Daelaam",
    "universe": 1,
    "description": "Hierarch Artanis is an indomitable warrior who seeks to unify his beleaguered people. As a renowned and experienced Templar, Artanis combines martial prowess and tactical acumen—striking swiftly with his psi-blades, taking the brunt of enemy assaults with his shields, or calling upon his flagship, the Spear of Adun, to turn his foes into dust. He’ll let nothing stand in his way to restore the glory of the protoss.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/artanis/skins/thumbnails/hierarch-of-the-daelaam.jpg"
  },
  {
    "name": "Lt. Morales",
    "title": "Combat Medic",
    "universe": 1,
    "description": "Lt. Morales joined the United Earth Directorate (UED) to make a difference and protect her family. Over a very long and storied career, she has distinguished herself as a peerless medic, able to keep her patients alive and in the fight long after anyone else would have gone down. Lt. Morales is a veteran of the Brood War, and even the destruction of the UED Expeditionary Fleet didn’t slow her down. In the Nexus, she does what she does best: heal her teammates, support her allies, and make a difference.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/lt-morales/skins/thumbnails/combat-medic.jpg"
  },
  {
    "name": "Rexxar",
    "title": "Champion of the Horde",
    "universe": 0,
    "description": "Out in the wild, there is only the law of the jungle; survival depends on having a pack, on looking out for one another. Together with his loyal animal companions, the bear Misha and Spirit the hawk, he prowls the Nexus, always looking for the next challenge. The strength of the bear, the hawk's swiftness, and the hunter's cunning make them a formidable (and inseparable) team.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/rexxar/skins/thumbnails/champion-of-the-horde.jpg"
  },
  {
    "name": "Kharazim",
    "title": "Veradani Monk",
    "universe": 2,
    "description": "To the Monks of Ivgorod, the gods are in all things, and their divine will is proclaimed by the Patriarchs. With unshakable faith, Kharazim followed their decree to discover heavenly fire that had fallen upon on the town of New Tristram.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/kharazim/skins/thumbnails/veradani-monk.jpg"
  },
  {
    "name": "Leoric",
    "title": "The Skeleton King",
    "universe": 2,
    "description": "The rule of king Leoric is remembered as a time of great tragedy, fear, and madness. In life, he was a tyrannical ruler, driven mad by the Lord of Terror; in death, Leoric rose again as the dreaded Skeleton King. Swinging his giant mace, Leoric laughs in the face of death. When struck down, his ghostly form drains the essence of the living, replenishing Leoric until he rises to terrorize the field of battle once again.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/leoric/skins/thumbnails/the-skeleton-king.jpg"
  },
  {
    "name": "The Butcher",
    "title": "Flesh Carver",
    "universe": 2,
    "description": "A grotesque shape lumbers across the Nexus, a cleaver and a blood-encrusted meat hook in his massive hands. His hunger, insatiable, insistent, drives him ever on to carve up his enemies and consume their fresh meat. Even those fighting alongside him shrink away in fear when he draws near. He is violence incarnate; he is brutality given shape. He is the Butcher.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/the-butcher/skins/thumbnails/flesh-carver.jpg"
  },
  {
    "name": "Johanna",
    "title": "Crusader of Zakarum",
    "universe": 2,
    "description": "There have been many women who have borne the name Johanna in service of the crusade, and each has given her life to purify her faith. Johanna carries on their legacy as she searches the kingdom of Khanduras for the fallen star.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/johanna/skins/thumbnails/crusader-of-zakarum.jpg"
  },
  {
    "name": "Kael'thas",
    "title": "The Sun King",
    "universe": 0,
    "description": "Like all Blood Elves, Prince Kael'thas was transformed by the fall of Quel'thalas. Desperate to save his people from being consumed by their magical addiction, he joined forces with the Burning Legion and now lords over Tempest Keep.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/kaelthas/skins/thumbnails/the-sun-king.jpg"
  },
  {
    "name": "Sylvanas",
    "title": "The Banshee Queen",
    "universe": 0,
    "description": "As ranger-general of Silvermoon, it was Sylvanas Windrunner's sworn duty to defend her home against all who would threaten Quel'thalas. She was an accomplished commander and a deadly archer, yet even Sylvanas could not stop the Scourge. Denying her a clean death, the Death Knight Arthas turned Sylvanas into a banshee. After Sylvanas regained her freedom, the Dark Lady rose to power as the Banshee Queen of the Forsaken undead. In the Nexus, Sylvanas haunts the battlefield, raining death on her opponents from afar and using her dark powers to twist and torment her enemies.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/sylvanas/skins/thumbnails/the-banshee-queen.jpg"
  },
  {
    "name": "The Lost Vikings",
    "title": "Triple Trouble",
    "universe": 3,
    "description": "The Lost Vikings are back! While they briefly considered retirement after defeating the emperor Tomator, there were only so many polar bears they could wrestle before falling into a Nexus portal seemed like a solid life decision.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/the-lost-vikings/skins/thumbnails/triple-trouble.jpg"
  },
  {
    "name": "Thrall",
    "title": "Warchief of the Horde",
    "universe": 0,
    "description": "As a child, Thrall served the cruel Aedelas Blackmoore as a slave. After gaining his freedom, he guided the liberated orcs to a land of their own, and worked to recover their ancient traditions. Now and forever, he is the Warchief of the Horde.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/thrall/skins/thumbnails/warchief-of-the-horde.jpg"
  },
  {
    "name": "Jaina",
    "title": "Archmage",
    "universe": 0,
    "description": "Jaina Proudmoore is a master spellcaster, trained by the legendary Archmage Antonidas himself. Brilliant, courageous, and wise, it was Jaina who led the survivors of the Scourge of Lordaeron to safety. But don't mistake her graciousness for weakness, or she will gladly demonstrate to you the folly of picking a fight with a sorceress.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/jaina/skins/thumbnails/archmage.jpg"
  },
  {
    "name": "Anub'arak",
    "title": "Traitor King",
    "universe": 0,
    "description": "Once a proud nerubian king, Anub'arak dared to stand against the Lich King's invasion, but despite his bravery, he too fell to the unrelenting Scourge. Resurrected into undeath, the Traitor King now serves as a towering, weapon of destruction.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/anubarak/skins/thumbnails/traitor-king.jpg"
  },
  {
    "name": "Azmodan",
    "title": "Lord of Sin",
    "universe": 2,
    "description": "The Lord of Sin rules over a densely populated land of hell where both the greatest joys and despair, and the deepest depravities can be experienced. But it is never enough for Azmodan, who has set his eyes on the realm of Sanctuary.",
    "roles": [3],
    "image": "http://us.battle.net/heroes/static/images/heroes/skins/thumbnails/azmodan_lordOfSin.jpg"
  },
  {
    "name": "Chen",
    "title": "Legendary Brewmaster",
    "universe": 0,
    "description": "To be a Brewmaster is to be an explorer, a lover of nature, and when the need arises; a powerful fighter. For years Chen Stormstout has wandered the world of Azeroth in search of rare ingredients, stirring stories, and of course, good brew.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/chen/skins/thumbnails/legendary-brewmaster.jpg"
  },
  {
    "name": "Rehgar",
    "title": "Shaman of the Earthen Ring",
    "universe": 0,
    "description": "Rehgar Earthfury has seen his share of combat, both as a gladiator, and a master of his own team of fighters. Now, having put that life aside, he serves as a simple shaman of the Earthen Ring, earning his redemption by healing the broken lands of Azeroth.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/rehgar/skins/thumbnails/shaman-of-the-earthen-ring.jpg"
  },
  {
    "name": "Zagara",
    "title": "Broodmother of the Swarm",
    "universe": 1,
    "description": "If Kerrigan is the Queen of the Zerg, then Zagara is the mother of the brood. Cunning and tenacious, she commands her vicious minions on the field of battle. Encounter her brood and beware: mess with her children and you answer to mama.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/zagara/skins/thumbnails/broodmother-of-the-swarm.jpg"
  },
  {
    "name": "Murky",
    "title": "Babu Murloc",
    "universe": 0,
    "description": "Mrgglglbrlg rmrmgllg mrggggm. Mrrglglgy, mgllglgl mgggrrmgll MRGGGLGLLM! Mrrggllgggllggll mrrglrlg mrrg mrrg mrrrg.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/murky/skins/thumbnails/baby-murloc.jpg"
  },
  {
    "name": "Brightwing",
    "title": "Faerie Dragon",
    "universe": 0,
    "description": "The Faerie Dragons of Ashenvale are known for their playful demeanor, seemingly disappearing at a whim. The mischievous Brightwing is no exception, often materializing out of nowhere to save her allies or just to mock her foes.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/brightwing/skins/thumbnails/faerie-dragon.jpg"
  },
  {
    "name": "Li Li",
    "title": "World Wandeler",
    "universe": 0,
    "description": "Born upon Shen-zin Su the Wandering Isle, Li Li Stormstout led a somewhat uneventful life until she began reading the journals of her uncle Chen. Soon, nothing would sate her desire for adventure, exploration, and pestering adventurers in the Valley of the Four Winds.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/li-li/skins/thumbnails/world-wanderer.jpg"
  },
  {
    "name": "Tychus",
    "title": "Notorious Outlaw",
    "universe": 1,
    "description": "Former soldier. Erstwhile thief. Convicted felon. Tychus Findlay and Jim Raynor share what some might call a checkered past—the type filled with daring exploits and courageous fights doing not so courageous deeds. While no one can be sure where Tychus' loyalties lie, one thing is for certain: he's a fearsome combatant whose impact on the battlefield is anything but subtle. Tychus always goes big. Always.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/tychus/skins/thumbnails/notorious-outlaw.jpg"
  },
  {
    "name": "Abathur",
    "title": "Evolution Master",
    "universe": 1,
    "description": "Abathur, the Evolution Master of Kerrigan's Swarm, works ceaselessly to improve the Zerg from the genetic level up. His hate for chaos and imperfection almost rivals his hatred of pronouns.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/abathur/skins/thumbnails/evolution-master.jpg"
  },
  {
    "name": "Arthas",
    "title": "The Lich King",
    "universe": 0,
    "description": "Once the crown prince of Lordaeron and the protégé of the legendary paladin Uther the Lightbringer, Prince Arthas fell to darkness. In a desperate bid to save his people he was corrupted by the cursed blade Frostmourne, its hatred consuming him. Now he serves the Lich King as a death knight eternally bound to his terrible destiny...and always a little cold.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/arthas/skins/thumbnails/the-lich-king.jpg"
  },
  {
    "name": "Diablo",
    "title": "Lord of Terror",
    "universe": 2,
    "description": "Known in the ancient tongue as Al'Diabolos, the Prime Evil of Terror, the demon lord Diablo seeks to claim the world of Sanctuary for the Burning Hells. As the Lord of Terror, Diablo thrives on the fear of others, only satiated by the horror of those who fall before him. His victims are innumerable, his schemes are unknowable, and his gender is...malleable.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/diablo/skins/thumbnails/lord-of-terror.jpg"
  },
  {
    "name": "E.T.C.",
    "title": "Rock God",
    "universe": 0,
    "description": "The Power of the Horde incarnated by brutal rhythms and blistering guitar riffs into the most elite tauren chieftain to ever headbang across the surface of Azeroth. Don't bother putting on socks. He's just going to rock them off anyways.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/etc/skins/thumbnails/rock-god.jpg"
  },
  {
    "name": "Falstad",
    "title": "Wildhammer Thane",
    "universe": 0,
    "description": "Falstad is the High Thane of the Wildhammer Clan and a founding member of the Council of Three Hammers that presides over Ironforge. Despite speculation, Falstad has never been dead and anyone who claims such is a liar.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/falstad/skins/thumbnails/wildhammer-thane.jpg"
  },
  {
    "name": "Gazlowe",
    "title": "Boss of Ratchet",
    "universe": 0,
    "description": "Upon first glance, few would think of the diminutive Gazlowe as a fighter, but what he lacks in height, he more than makes up for in mechanical cunning. The newest mechanical exoskeleton he's been working on for example is an especially effective war machine—when it's working.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/gazlowe/skins/thumbnails/boss-of-ratchet.jpg"
  },
  {
    "name": "Illidan",
    "title": "The Betrayer",
    "universe": 0,
    "description": "Illidan Stormrage, the original Demon Hunter, betrayed his people by creating a new Well of Eternity after the demonic invasion of Azeroth. After 10,000 years of imprisonment he was freed by Tyrande Whisperwind against his own brother Malfurion Stormrage's wishes. Now, Illidan lords over the realm of Outland, slaughtering unsuitably prepared heroes who venture into his domain.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/illidan/skins/thumbnails/the-betrayer.jpg"
  },
  {
    "name": "Kerrigan",
    "title": "Queen of Blades",
    "universe": 1,
    "description": "Once a Terran ghost with unprecedented psionic abilities, Sarah Kerrigan was betrayed by her allies and transformed by the ravenous zerg into the indomitable Queen of Blades. Now freed of The Dark God Amon's corruption, Kerrigan faces a threat that could destroy the galaxy itself.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/kerrigan/skins/thumbnails/queen-of-blades.jpg"
  },
  {
    "name": "Malfurion",
    "title": "Archdruid",
    "universe": 0,
    "description": "Malfurion Stormrage is the greatest druid on Azeroth and the chosen student of his Shan'do, the demigod Cenarius. Communing with nature through the Emerald Dream, Malfurion protects the wilds from both demonic influences and the savage Horde. His only weakness? A penchant for taking long, long, 1,000-years-long naps.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/malfurion/skins/thumbnails/archdruid.jpg"
  },
  {
    "name": "Muradin",
    "title": "Mountain King",
    "universe": 0,
    "description": "Once a mentor to Prince Arthas, Muradin was unable to prevent him from becoming the Lich King. After recovering from a mild case of amnesia, he is now the leader of the Bronzebeard clan since the \"diamond-ization\" of his brother, King Magni.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/muradin/skins/thumbnails/mountain-king.jpg"
  },
  {
    "name": "Nazeebo",
    "title": "Heretic Witch Doctor",
    "universe": 2,
    "description": "With cabalistic incantations and vestments of feather and bone, the heretic Witch Doctor Nazeebo of the Umbaru tribe calls upon spirits from the Unformed Land to aid him in battle. Few outlanders ever encounter a Witch Doctor in the flesh, without losing their own.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/nazeebo/skins/thumbnails/heretic-witch-doctor.jpg"
  },
  {
    "name": "Nova",
    "title": "Dominion Ghost",
    "universe": 1,
    "description": "November \"Nova\" Terra is a ghost of the Terran Dominion and one of the most powerful psionic soldiers ever known. Nova is highly focused, determined, and extremely deadly. Even Jim Raynor wouldn't want to be caught within her crosshairs.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/nova/skins/thumbnails/dominion-ghost.jpg"
  },
  {
    "name": "Raynor",
    "title": "Renegade Commander",
    "universe": 1,
    "description": "Ex-confederate marshal James Raynor has stood against whatever the universe can throw at him and survived with just a few scars and a penchant for Scotty Bolger's whiskey. He now stands as a bright beacon of hope in the face of a corrupt government, enigmatic protoss, and ferocious all-consuming zerg...No wonder the man drinks.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/raynor/skins/thumbnails/renegade-commander.jpg"
  },
  {
    "name": "Sgt. Hammer",
    "title": "Siege Tank Operator",
    "universe": 1,
    "description": "Sergeant Bama \"the Hammer\" Kowalski has served some of the toughest tours around the Koprulu sector. The roar of her siege tank's shock cannon strikes fear right into the heart of the toughest of warriors... including some of her allies.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/sgt-hammer/skins/thumbnails/siege-tank-operator.jpg"
  },
  {
    "name": "Sonya",
    "title": "Wandering Barbarian",
    "universe": 2,
    "description": "From the frozen Dreadlands of the north come the mighty Barbarian warriors. After surviving the destruction of her home and death of her tribe, Sonya wanders Sanctuary in search of battle and a better life for her people.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/sonya/skins/thumbnails/wandering-barbarian.jpg"
  },
  {
    "name": "Stitches",
    "title": "Terror of Darkshire",
    "universe": 0,
    "description": "Take care when traversing the shadowed trails of Duskwood...ever since Abercrombie the Embalmer unleashed his abomination upon Darkshire, Stitches has wandered the road aimlessly, hungering for the flesh of low level Alliance players.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/stitches/skins/thumbnails/terror-of-darkshire.jpg"
  },
  {
    "name": "Tassadar",
    "title": "Savior of the Temple",
    "universe": 1,
    "description": "An executor without equal, Tassadar stood against the orders of the conclave, uniting with the Dark Templar, and fought valiantly to save Aiur from the zerg. Channeling the Khala and the Void, he destroyed the Overmind at the cost of his own life. In the glory of combat, protoss warriors forever invoke his name: “En Taro, Tassadar!”",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/tassadar/skins/thumbnails/savior-of-the-templar.jpgg"
  },
  {
    "name": "Tyrael",
    "title": "Archangel of Justice",
    "universe": 2,
    "description": "Among the angels it is the Archangel of Justice Tyrael who is humanity's greatest defender. Wielding his sword El'druin against the Burning Hells, the Prime Evils would have enslaved Sanctuary and all of humanity long ago if Tyrael had not intervened.",
    "roles": [1],
    "image": "http://media.blizzard.com/heroes/tyrael/skins/thumbnails/archangel-of-justice.jpg"
  },
  {
    "name": "Tyrande",
    "title": "High Priestress of Elune",
    "universe": 0,
    "description": "Tyrande Whisperwind strikes fear into all who wish ill of the Kaldorei. As the highest ranking Sentinel and High Priestess of Elune, she is not only the Night Elves' most deadly warrior, but also their most cunning leader.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/tyrande/skins/thumbnails/high-priestess-of-elune.jpg"
  },
  {
    "name": "Uther",
    "title": "The Lightbringer",
    "universe": 0,
    "description": "The first paladin and founder of the Order of the Silver Hand, Uther the Lightbringer is a faithful servant of the Light. Dispensing justice with the swing of his hammer, Uther is a bastion of truth and an unflinching symbol of the Alliance.",
    "roles": [2],
    "image": "http://media.blizzard.com/heroes/uther/skins/thumbnails/the-lightbringer.jpg"
  },
  {
    "name": "Valla",
    "title": "Demon Hunter",
    "universe": 2,
    "description": "Valla witnessed the ferocity of hellspawn firsthand as the demons ravaged her village and left her for dead. Now, with no people to call her own, her only allegiance is to her cause: to rid Sanctuary of the demonic filth corrupting its lands. She also likes long walks on the beach, puppies, and crossbows.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/valla/skins/thumbnails/demon-hunter.jpg"
  },
  {
    "name": "Zeratul",
    "title": "Dark Prelate",
    "universe": 1,
    "description": "The enigmatic Dark Templar Zeratul serves the Xel'Naga. While he expertly wields the power of the Void, it is his wisdom that earns him the respect of the Koprulu sector's leaders - despite his penchant for dramatic entrances.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/zeratul/skins/thumbnails/dark-prelate.jpg"
  },
  {
    "name": "Probius",
    "title": "Curious Prob",
    "universe": 1,
    "description": "Since his activation, Probius has always wanted to prove himself. He may be small, but he made a big difference by warping in a critical pylon during the retaking of Aiur. As the bravest of probes, Probius is eager to fulfill his purpose in the Nexus.",
    "roles": [3],
    "image": "http://media.blizzard.com/heroes/probius/skins/thumbnails/curious-probe.jpg"
  },
  {
    "name": "Cassia",
    "title": "Amazon Warmatron",
    "universe": 2,
    "description": "After shattering the Worldstone, the young Amazon Cassia had changed. She had seen hatred, terror, and destruction firsthand. If the Askari were to survive the coming darkness, they needed an army. She would begin their training immediately.",
    "roles": [0],
    "image": "http://media.blizzard.com/heroes/cassia/skins/thumbnails/amazon-warmatron.jpg"
  }
]
